Feature: Регистация на потребител - параметрезиран пример

  Scenario Outline: Регистрация на потребител
  	Given Потребителя отваря екрана за регистрация
    When Въведе потребителско име: "<потребителско име>"
    And въведе първа парола: "<Първа парола>"
    And въведе втора парола: "<Втора парола>"
    And въведе електронна поща: "<email>"
    And натисне бутона за регистрация
    Then вижда съощение: "<съобщение>"
    
    Examples: 
      | потребителско име| съобщение                       | Първа парола|Втора парола|email      |
      | Иван             |Успешна регистрация!             |Pass1234!    |Pass1234!   |ivan@abv.bg|
      | Ив               |Въведете име с поне 3 синвола!   |Pass1234!    |Pass1234!   |ivan@abv.bg|
