
Feature: Регистрация на нов потребител

  Scenario: Успешна регистрация на нов потребител
    Given Потребителя отваря екрана за регистрация
    When Въведе потребителско име: "Иван"
    And въведе валид първа парола
    And въведе валид втора парола
    And въведе валидна електронна поща
    And натисне бутона за регистрация
    Then вижда съощение: "Успешна регистрация!"
    
  Scenario: Регистрация с късо име
    Given Потребителя отваря екрана за регистрация
    When Въведе потребителско име: "Ив" 
    And въведе валид първа парола
    And въведе валид втора парола
    And въведе валидна електронна поща
    And натисне бутона за регистрация
    Then вижда съощение: "Въведете име с поне 3 синвола!"
    
  Scenario: Регистрация с късо име 2
    Given Потребителя отваря екрана за регистрация
    When Въведе потребителско име: "" 
    And въведе валид първа парола
    And въведе валид втора парола
    And въведе валидна електронна поща
    And натисне бутона за регистрация
    Then вижда съощение: "Въведете име с поне 3 синвола!"
    
  Scenario: Регистрация с късо име 3
    Given Потребителя отваря екрана за регистрация
    When Въведе потребителско име: "     "
    And въведе валид първа парола
    And въведе валид втора парола
    And въведе валидна електронна поща
    And натисне бутона за регистрация
    Then вижда съощение: "Въведете име с поне 3 синвола!"

